{"config": [{"class_name": "Conv2D", "config": {"bias_constraint": null, "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "strides": [1, 1], "bias_regularizer": null, "padding": "valid", "kernel_constraint": null, "use_bias": true, "batch_input_shape": [null, 64, 64, 3], "trainable": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "data_format": "channels_last", "dilation_rate": [1, 1], "name": "conv2d_1", "kernel_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "name": "max_pooling2d_1", "data_format": "channels_last", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}}, {"class_name": "Dense", "config": {"bias_constraint": null, "units": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "trainable": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "name": "dense_1", "activity_regularizer": null}}, {"class_name": "Dense", "config": {"bias_constraint": null, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "trainable": true, "activation": "sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "name": "dense_2", "activity_regularizer": null}}], "backend": "tensorflow", "keras_version": "2.2.0", "class_name": "Sequential"}